spyren/Mecrisp-Cube/MecrispCubeWBfeather.ioc
Dma.SPI1_TX.5.MemInc=DMA_MINC_ENABLE
PC15-OSC32_OUT.Mode=LSE-External-Oscillator
Dma.USART1_TX.1.Instance=DMA1_Channel2
PB8.GPIOParameters=GPIO_PuPd,GPIO_Label
Dma.USART1_RX.0.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
PB9.GPIO_Label=D10
VP_STM32_WPAN_VS_BLE_HOST.Mode=STM32_WPAN_Enabled
ProjectManager.NoMain=false
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,DataSize,BaudRatePrescaler
USB_DEVICE.VirtualModeFS=Cdc_FS
NVIC.SavedSvcallIrqHandlerGenerated=true
FATFS._USE_MUTEX=1
VP_IPCC_VS_IPCC.Signal=IPCC_VS_IPCC
PA8.Stacked=true
PA3.Stacked=true
ProjectManager.DefaultFWLocation=true
VP_HSEM_VS_HSEM.Signal=HSEM_VS_HSEM
NVIC.IPCC_C1_TX_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
Dma.I2C1_TX.3.SyncEnable=DISABLE
ProjectManager.DeletePrevious=false
boardIOC=true
USB_DEVICE.IPParameters=VirtualMode,VirtualModeFS,CLASS_NAME_FS,USBD_DEBUG_LEVEL
Dma.USART1_RX.0.RequestNumber=1
Dma.USART1_RX.0.Polarity=HAL_DMAMUX_REQ_GEN_RISING
RCC.FamilyName=M
PB9.GPIOParameters=GPIO_PuPd,GPIO_Label
FATFS.IPParameters=_USE_MUTEX,_USE_LABEL,_USE_CHMOD,_FS_RPATH,_USE_FIND,_USE_EXPAND,_MULTI_PARTITION,_USE_FORWARD,_USE_LFN,_VOLUMES
USART1.VirtualMode-Asynchronous=VM_ASYNC
PA13.Signal=SYS_JTMS-SWDIO
SH.SharedStack_PA5.ConfNb=2
SH.SharedStack_PA1.ConfNb=2
NVIC.DMA1_Channel2_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
ProjectManager.TargetToolchain=STM32CubeIDE
FREERTOS.configTIMER_TASK_STACK_DEPTH=192
PB7.GPIOParameters=GPIO_Label
STM32_WPAN.BLE_CFG_DIS_SERIAL_NUMBER_STRING=1
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Mode=CDC_FS
RCC.HCLKRFFreq_Value=16000000
PB2.GPIOParameters=GPIO_Label
Dma.SPI1_RX.4.EventEnable=DISABLE
PE4.Locked=true
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=48000000
PC15-OSC32_OUT.Signal=RCC_OSC32_OUT
PA1.Signal=SharedStack_PA1
PB1.Locked=true
VP_FATFS_VS_Generic.Mode=User_defined
SH.SharedStack_PB6.ConfNb=2
RCC.SMPSCLockSelectionVirtual=RCC_SMPSCLKSOURCE_HSI
PB4.Stacked=true
board=P-NUCLEO-WB55-Nucleo
RCC.VCOOutputFreq_Value=128000000
RCC.SMPS1Freq_Value=8000000
NVIC.SavedSystickIrqHandlerGenerated=true
RCC.APB2Freq_Value=32000000
MxCube.Version=6.2.0
STM32_WPAN.BLE_CFG_DIS_SYSTEM_ID=1
RCC.PLLSAI1QoutputFreq_Value=48000000
RCC.ADCFreq_Value=32000000
PA10.GPIOParameters=GPIO_Label
Dma.USART1_RX.0.MemDataAlignment=DMA_MDATAALIGN_BYTE
OSC_OUT.Locked=true
Dma.SPI1_TX.5.SyncRequestNumber=1
STM32_WPAN.BLE_CFG_DIS_HARDWARE_REVISION_STRING=1
PA4.GPIOParameters=GPIO_Label
Dma.USART1_TX.1.SyncRequestNumber=1
SH.SharedAnalog_PA6.ConfNb=2
ADC1.NbrOfConversion=1
RCC.IPParameters=ADCCLockSelection,ADCFreq_Value,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,APB3Freq_Value,CK48CLockSelection,Cortex2Freq_Value,CortexFreq_Value,FCLK2Freq_Value,FCLKCortexFreq_Value,FamilyName,HCLK2Freq_Value,HCLK3Freq_Value,HCLKFreq_Value,HCLKRFFreq_Value,HSE_VALUE,HSI48_VALUE,HSI_VALUE,I2C1Freq_Value,I2C3Freq_Value,LCDFreq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPUART1Freq_Value,LSCOPinFreq_Value,LSI_VALUE,MCO1PinFreq_Value,PLLN,PLLPoutputFreq_Value,PLLQoutputFreq_Value,PLLRCLKFreq_Value,PLLSAI1N,PLLSAI1PoutputFreq_Value,PLLSAI1QoutputFreq_Value,PLLSAI1RoutputFreq_Value,PWRFreq_Value,RFWKPClockSelection,RFWKPFreq_Value,RNGFreq_Value,RTCClockSelection,RTCFreq_Value,SAI1Freq_Value,SMPS1Freq_Value,SMPSCLockSelectionVirtual,SMPSCLockSelectionVirtualVirtual,SMPSFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,USART1Freq_Value,USBFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAI1OutputFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32WB55CGUx
VP_IPCC_VS_IPCC.Mode=IPCC_Activate
RTC.Alarm-Alarm\ A=RTC_ALARM_A
NVIC.SavedPendsvIrqHandlerGenerated=true
PA2.Signal=SharedStack_PA2
PA13.GPIO_Label=JTMS
PB2.Locked=true
Mcu.IP8=RCC
VP_FREERTOS_VS_CMSIS_V2.Signal=FREERTOS_VS_CMSIS_V2
Dma.SPI1_RX.4.Priority=DMA_PRIORITY_LOW
Mcu.IP9=RF
Mcu.IP6=IPCC
Mcu.IP7=NVIC
ProjectManager.CoupleFile=true
PB5.Stacked=true
PB3.Signal=SharedStack_PB3
RCC.SYSCLKFreq_VALUE=32000000
Dma.SPI1_RX.4.Direction=DMA_PERIPH_TO_MEMORY
PA7.GPIO_Label=A3
PA1.Locked=true
Dma.I2C1_RX.2.RequestNumber=1
PA12.Mode=Device
PCC.Ble.ConnectionInterval=1000.0
Dma.SPI1_TX.5.Polarity=HAL_DMAMUX_REQ_GEN_RISING
KeepUserPlacement=false
Dma.I2C1_TX.3.EventEnable=DISABLE
STM32_WPAN.IPParameters=BLE_CFG_DIS_MODEL_NUMBER_STRING,BLE_CFG_DIS_SERIAL_NUMBER_STRING,BLE_CFG_DIS_HARDWARE_REVISION_STRING,BLE_CFG_DIS_FIRMWARE_REVISION_STRING,BLE_CFG_DIS_SOFTWARE_REVISION_STRING,BLE_CFG_DIS_SYSTEM_ID,LOCAL_NAME,LOCAL_NAME_FORMATTED,BLE_CFG_SVC_MAX_NBR_CB
PA13.Locked=true
RF1.Mode=RF1_Activate
PA14.Signal=SYS_JTCK-SWCLK
Dma.I2C1_TX.3.SyncRequestNumber=1
PB2.GPIO_Label=D12
Dma.USART1_TX.1.PeriphInc=DMA_PINC_DISABLE
TIM1.Channel-Output\ Compare1\ CH1=TIM_CHANNEL_1
Dma.I2C1_RX.2.SyncSignalID=NONE
RCC.HSI_VALUE=16000000
ADC1.NbrOfConversionFlag=1
RCC.PLLN=32
Dma.USART1_TX.1.EventEnable=DISABLE
PB7.Locked=true
PB8.Signal=SharedStack_PB8
Dma.SPI1_RX.4.SignalID=NONE
Dma.SPI1_TX.5.SyncEnable=DISABLE
VP_TINY_LPM_VS_TINY_LPM.Signal=TINY_LPM_VS_TINY_LPM
RTC.AlarmSubSecondMask-Alarm\ A=RTC_ALARMSUBSECONDMASK_NONE
Dma.I2C1_RX.2.EventEnable=DISABLE
RCC.APB1Freq_Value=32000000
RCC.RFWKPClockSelection=RCC_RFWKPCLKSOURCE_LSE
USB_DEVICE.VirtualMode=Cdc
STM32_WPAN.BLE_CFG_DIS_SOFTWARE_REVISION_STRING=1
ProjectManager.DeviceId=STM32WB55CGUx
ProjectManager.LibraryCopy=1
PA3.GPIO_Label=D6
PB1.GPIOParameters=GPIO_Label
PA7.Signal=SharedAnalog_PA7
PA6.Locked=true
isbadioc=false
